tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# HTTP/2 C Library
brew "nghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound", restart_service: true
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php@7.3", restart_service: true, link: true
# Object-relational database system
brew "postgresql", restart_service: true
# Tool Command Language
brew "tcl-tk"
# Web browser
cask "google-chrome"
# Open-source code editor
cask "visual-studio-code"
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
