tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# C library implementing the SSH2 protocol
brew "libssh2"
# Modern replacement for 'ls'
brew "exa"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Conversion library
brew "libiconv"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php@8.0", link: true
# Object-relational database system
brew "postgresql@14", restart_service: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool Command Language
brew "tcl-tk"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Web browser
cask "firefox"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "Angular.ng-template"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cjhowe7.laravel-blade"
vscode "cyrilletuzi.angular-schematics"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "mikestead.dotenv"
vscode "octref.vetur"
vscode "philnash.ngrok-for-vscode"
vscode "ritwickdey.LiveServer"
